Tekla.Structures.Model.BaseWeld.WeldTypeEnum
The weld types.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_NONE
No weld type.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_EDGE_FLANGE
The edge-flange weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_SQUARE_GROOVE_SQUARE_BUTT
The square-groove (square butt) weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_BEVEL_GROOVE_SINGLE_V_BUTT
The bevel-groove (single-V butt) weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_BEVEL_GROOVE_SINGLE_BEVEL_BUTT
The bevel-groove (single-bevel butt) weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_SINGLE_V_BUTT_WITH_BROAD_ROOT_FACE
The single-V butt weld with broad root face.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_SINGLE_BEVEL_BUTT_WITH_BROAD_ROOT_FACE
The single-bevel butt weld with broad root face.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_U_GROOVE_SINGLE_U_BUTT
The U-groove (single U-butt) weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_J_GROOVE_J_BUTT
The J-groove (single J-butt) weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_BEVEL_BACKING
The bevel backing weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_FILLET
The fillet weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_PLUG
The plug weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_SPOT
The spot weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_SEAM
The seam weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_SLOT
The slot weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_FLARE_BEVEL_GROOVE
The flare-bevel-groove weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_FLARE_V_GROOVE
The flare V-groove weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_CORNER_FLANGE
The corner-flange weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_PARTIAL_PENETRATION_SINGLE_BEVEL_BUTT_PLUS_FILLET
The partial penetration (single-bevel butt + fillet) weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_PARTIAL_PENETRATION_SQUARE_GROOVE_PLUS_FILLET
The partial penetration (square groove + fillet) weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_MELT_THROUGH
The melt-through weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.STEEP_FLANKED_BEVEL_GROOVE_SINGLE_V_BUTT
The steep flanked bevel groove single-V butt weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.STEEP_FLANKED_BEVEL_GROOVE_SINGLE_BEVEL_BUTT
The steep flanked bevel groove single-bevel butt weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_EDGE
The edge weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_ISO_SURFACING
The ISO surfacing weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_FOLD
The fold weld.

Tekla.Structures.Model.BaseWeld.WeldTypeEnum.WELD_TYPE_INCLINED
The inclined weld.